In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('dummy.csv')

In [6]:
df.dropna(inplace=True)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 723 entries, 0 to 998
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      723 non-null    object
 1   age       723 non-null    float64
 2   height    723 non-null    float64
 3   exercise  723 non-null    object
 4   dob       723 non-null    object
dtypes: float64(2), object(3)
memory usage: 33.9+ KB

In [9]:
df['age'] = df['age'].astype(int)

In [11]:
df['height'] = df['height'].astype(float)

In [12]:
df['exercise'] = df['exercise'].astype(bool)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 723 entries, 0 to 998
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      723 non-null    object
 1   age       723 non-null    int64
 2   height    723 non-null    float64
 3   exercise  723 non-null    bool
 4   dob       723 non-null    object
dtypes: bool(1), float64(1), int64(1), object(2)
memory usage: 28.9+ KB

In [15]:
df['dob'] = pd.to_datetime(df['dob'])

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 723 entries, 0 to 998
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      723 non-null    object
 1   age       723 non-null    int64
 2   height    723 non-null    float64
 3   exercise  723 non-null    bool
 4   dob       723 non-null    datetime64[ns]
dtypes: bool(1), datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 28.9+ KB

In [17]:
df.head()

       name  age  height  exercise        dob
0     Guido    1    5.61     False 2022-11-27
1    Ashlen    2    6.11     False 2022-07-13
2     Jules    3    5.85     False 2022-11-18
3   Quinton    4    5.23      True 2023-01-18
6  Joceline    7    5.67      True 2023-04-02

In [20]:
x = df.drop(columns=['name','exercise','dob'])

In [21]:
x.corr()

             age    height
age     1.000000 -0.022778
height -0.022778  1.000000